module.exports = {
 config: {
	 name: "rule",
	 version: "1.0",
	 author: "SaGor",//full modofi by sagor
	 countDown: 5,
	 role: 0,
	 shortDescription: "no prefix",
	 longDescription: "no prefix",
	 category: "auto 🪐",
 },

 onStart: async function(){}, 
 onChat: async function({ event, message, getLang }) {
 if (event.body && event.body.toLowerCase() === "rol") {
 return message.reply({
 body: `Assalamu alaikum

🦋𝄞⋆⃝🇧 🇴 🇹 ⋆⃝𝄞♡🦋

 গ্রুপের  কিছু 🍃💥নিয়ম কানুন আছে যেটা মানা আমাদের অতি জরুরী☺

(1)~গ্রুপের name & profile কেউ চেঞ্জ করতে পারবে না & গ্রুপে কেউ মেম্বার এড করলে এডমিনদের সাথে আগে যোগাযোগ করবেন 🥰 💥🍀🔥

(2)~„"গ্রুপে সবাই মিলেমিশে থাকবো কোনো রকম ঝগড়া করবো না💥🍀🔥 

(3)~„"গ্রুপে কোনো ১৮+ ছবি বা ভিডিও দেওয়া যাবে না❌🔞🔥😊

(4)~„"গ্রুপের কোনো মেম্বারের ইনবক্সে যাওয়া যাবে না ❌কোনো জরুরী কথা থাকলে এডমিনের পারমিশন নিবেন💥🍀😊

(5)~„" গ্রুপে কারো সাথে রিলেশন করে এটা নিয়ে গ্রুপে সমস্যা করলে ২জন কে রিমুভ করা হবে🍀💥☑️

(6)~„"৩....দিনের বেশি এক্টিভ না থাকলে গ্রুপ থেকে রিমুভ করা হবে🍀💥☑️

(7)~„"নতুন মেম্বার আসলে সবাই নতুন মেম্বার কে ওয়েলকাম জানাবেন 💥🌼🥰

(8)~„"গ্রুপে ঝামেলা হলে নিজ দায়িত্বে এডমিন কে জানাবেন 🍀💥

(9)~„" গ্রুপের এডমিন বা মেম্বার যদি কেউ কারো ইনবক্সে বিরক্ত করে তাহলে সাথে সাথে 🔥 Admin🔥 কে জানাবেন💥🔥🍀

(10)~„"গ্রুপে কেউ বিনা কারনে Offline লাগাবে তাকে রিমভ করা হবে, এডমিন রা,🥰🌿

(11)""গ্রুপে অন্য কোনো গ্রুপ এর ইস্কিন সর্ট & video দিতে পারবেন না,🥰
(12) '"গ্রুপে এ কোনো মেম্বার যদি (২)বার এর বেসি লিপট নেয় তাকে তৃতীয় বার এড্ড দেওয়া যাবে না🥰😍

(13)~''„গ্রুপে কোন বাজে কথা বলা যাবে না যদি কেউ এমন এমন কিছু করে তাকে গ্রুপ থেকে বের করে দেওয়া হবে। 
🙂🙂🙂সবাই নিয়ম  মেনে চলবেন আশা করি😊😊
               👇
👉‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ ‎‎‎‎‎⫷⑅⃝🔴C̶🌹E̶🔴O̶✺»̶͓͓̽̽ 𝐒𝐀𝐆𝐎𝐑

♥~ভালোবাসা😍অবিরাম😍

🌿🌺🥀ধন্যবাদ🥀🌺🌿

 শেষ কথা হচ্ছে গ্রুপে প্রেম প্রিরিতি নিয়ে যারা সম্যসা করবে তাদেরকে বিনা: অনুমতিতে রিমভ করা হবে🙏🙏🙏`,
 });
 }
 }
}
